ANSI-Common-LISP/docs/exercise-8.md


# exercise-8

1.  [Is it possible for two symbols to have the same name but not be `eql`?](#orgc8b2955)
2.  [Estimate the difference between&#x2026;](#org10b2d45)
3.  [The call to `defpackage` on page 137&#x2026;](#org8f79d12)
4.  [Add the code necessary to make&#x2026;](#org445a4c0)
5.  [Write a program that can&#x2026;](#orga8d5fbd)
6.  [Write a version of Henley that&#x2026;](#org8f21408)


<a id="orgc8b2955"></a>

## Is it possible for two symbols to have the same name but not be `eql`?


<a id="org10b2d45"></a>

## Estimate the difference between&#x2026;

2.Estimate the difference between the amount of memory used to represent the string "FOO" and the amount used to represent the symbol `foo`.


<a id="org8f79d12"></a>

## The call to `defpackage` on page 137&#x2026;

3.The call to `defpackage` on page 137 used only strings as arguments. We could have used symbols instead. Why might this have been dangerous?


<a id="org445a4c0"></a>

## Add the code necessary to make&#x2026;

4.Add the code necessary to make the code in Figure 7.1 be in a package named "RING", and that in Figure 7.2 be in a package named "FILE". The existing code should remain unchanged.


<a id="orga8d5fbd"></a>

## Write a program that can&#x2026;

5.Write a program that can verify whether or not a quote was produced by Henley ([section 8.8](section-8-8.md)).


<a id="org8f21408"></a>

## Write a version of Henley that&#x2026;

6.Write a version of Henley that can take a word and generate a sentence with that word in the middle of it([section 8.8](section-8-8.md)).

